app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit #load data into the form so user can edit specific instance
    @article = Article.find(params[:id])